# Data

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

![alt text](https://www.geeksforgeeks.org/wp-content/uploads/creating_dataframe1.png)

In [35]:
import pandas as pd
df=pd.read_csv('/content/drive/MyDrive/FoDS-2021/data/weather_data.csv')

In [5]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [ ]:
df.dtypes

day            object
temperature     int64
windspeed       int64
event          object
dtype: object

In [ ]:
weather_data = {
    'day': ['1/1/2017','1/2/2017','1/3/2017','1/4/2017','1/5/2017','1/6/2017'],
    'temperature': [32,35,28,24,32,31],
    'windspeed': [6,7,2,7,4,2],
    'event': ['Rain', 'Sunny', 'Snow','Snow','Rain', 'Sunny']
}

df1=pd.DataFrame(weather_data)

In [ ]:
df1

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [ ]:
df2=pd.read_csv('https://raw.githubusercontent.com/kelseyhightower/weather-data/master/weather.csv')

In [ ]:
df2.head()

   2000  11  30  23  00  6.65
0  2000  12   1   0   0  5.83
1  2000  12   1   1   0  5.06
2  2000  12   1   2   0  4.35
3  2000  12   1   3   0  3.68
4  2000  12   1   4   0  3.20

In [ ]:
df3=pd.read_csv('/content/drive/MyDrive/FoDS-2021/data/pandas_tutorial_read.csv',sep=';')

In [ ]:
df3

      2018-01-01 00:01:01  read  country_7  2458151261      SEO  North America
0     2018-01-01 00:03:20  read  country_7  2458151262      SEO  South America
1     2018-01-01 00:04:01  read  country_7  2458151263  AdWords         Africa
2     2018-01-01 00:04:02  read  country_7  2458151264  AdWords         Europe
3     2018-01-01 00:05:03  read  country_8  2458151265   Reddit  North America
4     2018-01-01 00:05:42  read  country_6  2458151266   Reddit  North America
...                   ...   ...        ...         ...      ...            ...
1789  2018-01-01 23:57:14  read  country_2  2458153051  AdWords  North America
1790  2018-01-01 23:58:33  read  country_8  2458153052      SEO           Asia
1791  2018-01-01 23:59:36  read  country_6  2458153053   Reddit           Asia
1792  2018-01-01 23:59:36  read  country_7  2458153054  AdWords         Europe
1793  2018-01-01 23:59:38  read  country_5  2458153055   Reddit           Asia

[1794 rows x 6 columns]

In [ ]:
df2=pd.read_csv('https://raw.githubusercontent.com/kelseyhightower/weather-data/master/weather.csv'
,names=['col1','col2','col3','col4','col5','col6'])

In [ ]:
df2

        col1  col2  col3  col4  col5  col6
0       2000    11    30    23     0  6.65
1       2000    12     1     0     0  5.83
2       2000    12     1     1     0  5.06
3       2000    12     1     2     0  4.35
4       2000    12     1     3     0  3.68
...      ...   ...   ...   ...   ...   ...
149995  2018     1    10    18     0  6.74
149996  2018     1    10    19     0  6.08
149997  2018     1    10    20     0  6.39
149998  2018     1    10    21     0  5.76
149999  2018     1    10    22     0  4.05

[150000 rows x 6 columns]

In [6]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [7]:
df.set_index('day')

          temperature  windspeed  event
day
1/1/2017           32          6   Rain
1/2/2017           35          7  Sunny
1/3/2017           28          2   Snow
1/4/2017           24          7   Snow
1/5/2017           32          4   Rain
1/6/2017           31          2  Sunny

In [8]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [9]:
df.set_index('day',inplace=True)

#df=df.set_index('day')

In [10]:
df

          temperature  windspeed  event
day
1/1/2017           32          6   Rain
1/2/2017           35          7  Sunny
1/3/2017           28          2   Snow
1/4/2017           24          7   Snow
1/5/2017           32          4   Rain
1/6/2017           31          2  Sunny

In [14]:
df.reset_index(inplace=True)

In [15]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [16]:
df['temperature']

0    32
1    35
2    28
3    24
4    32
5    31
Name: temperature, dtype: int64

In [17]:
df['windspeed']

0    6
1    7
2    2
3    7
4    4
5    2
Name: windspeed, dtype: int64

In [18]:
df['temperature']=df['temperature']+1

In [19]:
df

        day  temperature  windspeed  event
0  1/1/2017           33          6   Rain
1  1/2/2017           36          7  Sunny
2  1/3/2017           29          2   Snow
3  1/4/2017           25          7   Snow
4  1/5/2017           33          4   Rain
5  1/6/2017           32          2  Sunny

In [20]:
df[['temperature','event']]

   temperature  event
0           33   Rain
1           36  Sunny
2           29   Snow
3           25   Snow
4           33   Rain
5           32  Sunny

In [21]:
df.event

0     Rain
1    Sunny
2     Snow
3     Snow
4     Rain
5    Sunny
Name: event, dtype: object

In [22]:
df['event']

0     Rain
1    Sunny
2     Snow
3     Snow
4     Rain
5    Sunny
Name: event, dtype: object

In [23]:
df.rename(columns={'event':'EVENT','day':'Date'},inplace=True)

In [24]:
df

       Date  temperature  windspeed  EVENT
0  1/1/2017           33          6   Rain
1  1/2/2017           36          7  Sunny
2  1/3/2017           29          2   Snow
3  1/4/2017           25          7   Snow
4  1/5/2017           33          4   Rain
5  1/6/2017           32          2  Sunny

In [27]:
df.dtypes

Date           object
temperature     int64
windspeed       int64
EVENT          object
dtype: object

In [25]:
df.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     31.333333   4.666667
std       3.829708   2.338090
min      25.000000   2.000000
25%      29.750000   2.500000
50%      32.500000   5.000000
75%      33.000000   6.750000
max      36.000000   7.000000

In [26]:
df.describe(include='all')

            Date  temperature  windspeed EVENT
count          6     6.000000   6.000000     6
unique         6          NaN        NaN     3
top     1/6/2017          NaN        NaN  Rain
freq           1          NaN        NaN     2
mean         NaN    31.333333   4.666667   NaN
std          NaN     3.829708   2.338090   NaN
min          NaN    25.000000   2.000000   NaN
25%          NaN    29.750000   2.500000   NaN
50%          NaN    32.500000   5.000000   NaN
75%          NaN    33.000000   6.750000   NaN
max          NaN    36.000000   7.000000   NaN

In [28]:
df['EVENT'].value_counts()

Rain     2
Snow     2
Sunny    2
Name: EVENT, dtype: int64

In [29]:
df['Date'].value_counts()

1/6/2017    1
1/5/2017    1
1/4/2017    1
1/2/2017    1
1/1/2017    1
1/3/2017    1
Name: Date, dtype: int64

In [33]:
df.drop(['EVENT'],axis=1,inplace=True)

In [34]:
df

       Date  temperature  windspeed
0  1/1/2017           33          6
1  1/2/2017           36          7
2  1/3/2017           29          2
3  1/4/2017           25          7
4  1/5/2017           33          4
5  1/6/2017           32          2

In [39]:
import pandas as pd
df=pd.read_csv('/content/drive/MyDrive/FoDS-2021/data/weather_data.csv')

In [40]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [42]:
df.drop(['temperature','windspeed'],axis=1)

        day  event
0  1/1/2017   Rain
1  1/2/2017  Sunny
2  1/3/2017   Snow
3  1/4/2017   Snow
4  1/5/2017   Rain
5  1/6/2017  Sunny

In [43]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [44]:
df.drop(columns=['temperature','windspeed'],axis=1)

        day  event
0  1/1/2017   Rain
1  1/2/2017  Sunny
2  1/3/2017   Snow
3  1/4/2017   Snow
4  1/5/2017   Rain
5  1/6/2017  Sunny

In [46]:
df.drop(df.columns=[[0,1]],axis=1)

SyntaxError: ignored

In [ ]:
shape
dtypes
value_counts
drop
describe
info
set_index
reset_index
inplace

In [51]:
df1=pd.read_csv('/content/drive/My Drive/FoDS-2021/data/CSV_EX_1.csv')

In [52]:
df1

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

In [53]:
df2=pd.read_csv('/content/drive/My Drive/FoDS-2021/data/CSV_EX_2.csv')

In [54]:
df2

   2   1500        Good   300000
0  3   1300        Fair   240000
1  3   1900   Very good   450000
2  3   1850         Bad   280000
3  2   1640        Good   310000

In [55]:
df2=pd.read_csv('/content/drive/My Drive/FoDS-2021/data/CSV_EX_2.csv',header=None)

In [56]:
df2

   0     1           2       3
0  2  1500        Good  300000
1  3  1300        Fair  240000
2  3  1900   Very good  450000
3  3  1850         Bad  280000
4  2  1640        Good  310000

In [57]:
df2=pd.read_csv('/content/drive/My Drive/FoDS-2021/data/CSV_EX_2.csv',
                header=None,names=['Bedroom','Sq. foot','Locality','Price ($)'])

In [58]:
df2

   Bedroom  Sq. foot    Locality  Price ($)
0        2      1500        Good     300000
1        3      1300        Fair     240000
2        3      1900   Very good     450000
3        3      1850         Bad     280000
4        2      1640        Good     310000

In [61]:
df3=pd.read_csv('/content/drive/My Drive/FoDS-2021/data/CSV_EX_3.csv')

In [62]:
df3

  Bedroom; Sq. foot; Locality; Price ($)
0                  2; 1500; Good; 300000
1                  3; 1300; Fair; 240000
2             3; 1900; Very good; 450000
3                   3; 1850; Bad; 280000
4                  2; 1640; Good; 310000

In [63]:
df3=pd.read_csv('/content/drive/My Drive/FoDS-2021/data/CSV_EX_3.csv',sep=';')

In [64]:
df3

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

In [65]:
df4=pd.read_csv('/content/drive/My Drive/FoDS-2021/data/CSV_EX_skiprows.csv')

In [66]:
df4

  Filetype: CSV              Unnamed: 1  Unnamed: 2  Unnamed: 3
0           NaN  Info about some houses         NaN         NaN
1       Bedroom                Sq. foot    Locality   Price ($)
2             2                    1500        Good      300000
3             3                    1300        Fair      240000
4             3                    1900   Very good      450000
5             3                    1850         Bad      280000
6             2                    1640        Good      310000

In [67]:
df4=pd.read_csv('/content/drive/My Drive/FoDS-2021/data/CSV_EX_skiprows.csv',skiprows=2)

In [68]:
df4

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

In [73]:
df5=pd.read_csv('/content/drive/My Drive/FoDS-2021/data/CSV_EX_skipfooter.csv',skiprows=2,engine='python')

In [74]:
df5

   Bedroom                  Sq. foot    Locality   Price ($)
0      2.0                      1500        Good    300000.0
1      3.0                      1300        Fair    240000.0
2      3.0                      1900   Very good    450000.0
3      3.0                      1850         Bad    280000.0
4      2.0                      1640        Good    310000.0
5      NaN   This is the end of file         NaN         NaN

In [75]:
df5=pd.read_csv('/content/drive/My Drive/FoDS-2021/data/CSV_EX_skipfooter.csv',skiprows=2,skipfooter=1,engine='python')

In [76]:
df5

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000